[Survived] App\Mutator\Html\InputHiddenTypeAlternativesMutator
:43:6
     public function insertHiddenToken()
     {
      //$hidden = "<!--\n--><input type=\"hidden\"" . " name=\"token-csrf\"" . " value=\"" . $_COOKIE["PHPSESSID"] . "\"" . " />";
-     $hidden = "<input type=\"hidden\"" . " name=\"token-csrf\"" . " value=12345" . " />";
+     $hidden = "<input type=\"button\"" . " name=\"token-csrf\"" . " value=12345" . " />";
   
      return $hidden;

[Survived] App\Mutator\Html\InputToSelectHtmlTagMutator
:43:6
     public function insertHiddenToken()
     {
      //$hidden = "<!--\n--><input type=\"hidden\"" . " name=\"token-csrf\"" . " value=\"" . $_COOKIE["PHPSESSID"] . "\"" . " />";
-     $hidden = "<input type=\"hidden\"" . " name=\"token-csrf\"" . " value=12345" . " />";
+     $hidden = "<select type=\"hidden\"" . " name=\"token-csrf\"" . " value=12345" . " />";
   
      return $hidden;

[Killed] App\Mutator\Security\StrcmpToEqualityAlternativesMutator
:60:9
             $expected = $this->session[$this->sessionTokenLabel];
         }
         //return hash_equals($expected, $submittedToken);
-        return strcmp($expected, $submittedToken) ; 
+        return hash_equals($expected, $submittedToken);
     }
 
killedBy: Tests\CWE352CSRFTest::testValidateCSRFToken
statusReason: 1) Tests\CWE352CSRFTest::testValidateCSRFToken
Failed asserting that true is identical to 0.

D:\Kegiatanku\S3\Semester 8\PPT\Kelompok 3 IPL\traversal-vulnerabilities-main_CSRF\traversal-vulnerabilities-main\tests\CWE352CSRFTest.php:40

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] App\Mutator\Security\StrcmpToEqualityAlternativesMutator
:60:9
             $expected = $this->session[$this->sessionTokenLabel];
         }
         //return hash_equals($expected, $submittedToken);
-        return strcmp($expected, $submittedToken) ; 
+        return $expected === $submittedToken;
     }
 
killedBy: Tests\CWE352CSRFTest::testValidateCSRFToken
statusReason: 1) Tests\CWE352CSRFTest::testValidateCSRFToken
Failed asserting that true is identical to 0.

D:\Kegiatanku\S3\Semester 8\PPT\Kelompok 3 IPL\traversal-vulnerabilities-main_CSRF\traversal-vulnerabilities-main\tests\CWE352CSRFTest.php:40

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Survived] App\Mutator\RandomBytesToRandMutator
:67:13
     public function getCSRFToken()
     {   $this->unsetToken();
         if (empty($this->session[$this->sessionTokenLabel])) {
-            $this->session[$this->sessionTokenLabel] = bin2hex(random_bytes($this->tokenLen));
+            $this->session[$this->sessionTokenLabel] = bin2hex(rand(0, $this->tokenLen));
         }
         if ($this->hmac_ip !== false) {

[Survived] RandomBytesToRandomInt
:67:13
     public function getCSRFToken()
     {   $this->unsetToken();
         if (empty($this->session[$this->sessionTokenLabel])) {
-            $this->session[$this->sessionTokenLabel] = bin2hex(random_bytes($this->tokenLen));
+            $this->session[$this->sessionTokenLabel] = bin2hex(random_int(0, $this->tokenLen));
         }
         if ($this->hmac_ip !== false) {

[Killed] App\Mutator\Security\HashHmacAlgoAlternativesMutator
:87:9
     {//based on
         //$message = $_COOKIE["PHPSESSID"]. "!" .$token;
         $message = "12345!" .$token;
-        $hashHmac = \hash_hmac($this->hashAlgo, $message , $this->hmacData);
+        $hashHmac = \hash_hmac('SHA-512', $message, $this->hmacData);
         return $hashHmac;
     }
killedBy: Tests\CWE352CSRFTest::testCsrfTokenGeneration
statusReason: 1) Tests\CWE352CSRFTest::testCsrfTokenGeneration
ValueError: hash_hmac(): Argument #1 ($algo) must be a valid cryptographic hashing algorithm

D:\Kegiatanku\S3\Semester 8\PPT\Kelompok 3 IPL\traversal-vulnerabilities-main_CSRF\traversal-vulnerabilities-main\src\UserProfileRead.php:80
D:\Kegiatanku\S3\Semester 8\PPT\Kelompok 3 IPL\traversal-vulnerabilities-main_CSRF\traversal-vulnerabilities-mai

[Killed] App\Mutator\Security\HashHmacAlgoAlternativesMutator
:87:9
     {//based on
         //$message = $_COOKIE["PHPSESSID"]. "!" .$token;
         $message = "12345!" .$token;
-        $hashHmac = \hash_hmac($this->hashAlgo, $message , $this->hmacData);
+        $hashHmac = \hash_hmac('SHA-256', $message, $this->hmacData);
         return $hashHmac;
     }
killedBy: Tests\CWE352CSRFTest::testCsrfTokenGeneration
statusReason: 1) Tests\CWE352CSRFTest::testCsrfTokenGeneration
ValueError: hash_hmac(): Argument #1 ($algo) must be a valid cryptographic hashing algorithm

D:\Kegiatanku\S3\Semester 8\PPT\Kelompok 3 IPL\traversal-vulnerabilities-main_CSRF\traversal-vulnerabilities-main\src\UserProfileRead.php:80
D:\Kegiatanku\S3\Semester 8\PPT\Kelompok 3 IPL\traversal-vulnerabilities-main_CSRF\traversal-vulnerabilities-mai
